{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,768,1024,3],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.05,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":24,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":48,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"conv2d_Conv2D5","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"conv2d_Conv2D6","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D6","trainable":true},"inbound_nodes":[[["conv2d_Conv2D5",0,0,{}]]]},{"name":"conv2d_Conv2D7","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D7","trainable":true},"inbound_nodes":[[["conv2d_Conv2D6",0,0,{}]]]},{"name":"conv2d_Conv2D8","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D8","trainable":true},"inbound_nodes":[[["conv2d_Conv2D7",0,0,{}]]]},{"name":"conv2d_Conv2D9","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D9","trainable":true},"inbound_nodes":[[["conv2d_Conv2D8",0,0,{}]]]},{"name":"conv2d_Conv2D10","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D10","trainable":true},"inbound_nodes":[[["conv2d_Conv2D9",0,0,{}]]]},{"name":"conv2d_transpose_Conv2DTranspose1","class_name":"Conv2DTranspose","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D10",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["conv2d_transpose_Conv2DTranspose1",0,0,{}],["conv2d_Conv2D8",0,0,{}]]]},{"name":"conv2d_Conv2D11","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D11","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"conv2d_Conv2D12","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D12","trainable":true},"inbound_nodes":[[["conv2d_Conv2D11",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D1","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D12",0,0,{}]]]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D1",0,0,{}],["conv2d_Conv2D7",0,0,{}]]]},{"name":"conv2d_Conv2D13","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D13","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]},{"name":"conv2d_Conv2D14","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D14","trainable":true},"inbound_nodes":[[["conv2d_Conv2D13",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D2","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D14",0,0,{}]]]},{"name":"concatenate_Concatenate3","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate3","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D2",0,0,{}],["conv2d_Conv2D6",0,0,{}]]]},{"name":"conv2d_Conv2D15","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D15","trainable":true},"inbound_nodes":[[["concatenate_Concatenate3",0,0,{}]]]},{"name":"conv2d_Conv2D16","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D16","trainable":true},"inbound_nodes":[[["conv2d_Conv2D15",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D3","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D16",0,0,{}]]]},{"name":"concatenate_Concatenate4","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate4","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D3",0,0,{}],["conv2d_Conv2D5",0,0,{}]]]},{"name":"conv2d_Conv2D17","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D17","trainable":true},"inbound_nodes":[[["concatenate_Concatenate4",0,0,{}]]]},{"name":"conv2d_Conv2D18","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"elu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D18","trainable":true},"inbound_nodes":[[["conv2d_Conv2D17",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D4","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D18",0,0,{}]]]},{"name":"concatenate_Concatenate5","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate5","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D4",0,0,{}],["conv2d_Conv2D4",0,0,{}]]]},{"name":"conv2d_Conv2D19","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"tanh","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D19","trainable":true},"inbound_nodes":[[["concatenate_Concatenate5",0,0,{}]]]},{"name":"conv2d_Conv2D20","class_name":"Conv2D","config":{"filters":3,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D20","trainable":true},"inbound_nodes":[[["conv2d_Conv2D19",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["conv2d_Conv2D20",0,0]]},"keras_version":"tfjs-layers 3.7.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[5,5,3,16],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[3,3,16,24],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[24],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[3,3,24,32],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[3,3,32,48],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[48],"dtype":"float32"},{"name":"conv2d_Conv2D5/kernel","shape":[3,3,48,64],"dtype":"float32"},{"name":"conv2d_Conv2D5/bias","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D6/kernel","shape":[3,3,64,128],"dtype":"float32"},{"name":"conv2d_Conv2D6/bias","shape":[128],"dtype":"float32"},{"name":"conv2d_Conv2D7/kernel","shape":[3,3,128,128],"dtype":"float32"},{"name":"conv2d_Conv2D7/bias","shape":[128],"dtype":"float32"},{"name":"conv2d_Conv2D8/kernel","shape":[3,3,128,256],"dtype":"float32"},{"name":"conv2d_Conv2D8/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D9/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D9/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D10/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D10/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D11/kernel","shape":[3,3,512,256],"dtype":"float32"},{"name":"conv2d_Conv2D11/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D12/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D12/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D13/kernel","shape":[3,3,384,256],"dtype":"float32"},{"name":"conv2d_Conv2D13/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D14/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D14/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D15/kernel","shape":[3,3,384,256],"dtype":"float32"},{"name":"conv2d_Conv2D15/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D16/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D16/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D17/kernel","shape":[3,3,320,256],"dtype":"float32"},{"name":"conv2d_Conv2D17/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D18/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D18/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D19/kernel","shape":[3,3,304,256],"dtype":"float32"},{"name":"conv2d_Conv2D19/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D20/kernel","shape":[3,3,256,3],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.7.0","convertedBy":null}