{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"img","class_name":"InputLayer","config":{"batch_input_shape":[null,768,1024,3],"dtype":"float32","sparse":false,"name":"img"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[5,5],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["img",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU1","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":24,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU2","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU2",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU3","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":48,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU3",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU4","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"conv2d_Conv2D5","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU4",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU5","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU5","trainable":true},"inbound_nodes":[[["conv2d_Conv2D5",0,0,{}]]]},{"name":"conv2d_Conv2D6","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D6","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU5",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU6","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU6","trainable":true},"inbound_nodes":[[["conv2d_Conv2D6",0,0,{}]]]},{"name":"conv2d_Conv2D7","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D7","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU6",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU7","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU7","trainable":true},"inbound_nodes":[[["conv2d_Conv2D7",0,0,{}]]]},{"name":"conv2d_Conv2D8","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D8","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU7",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU8","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU8","trainable":true},"inbound_nodes":[[["conv2d_Conv2D8",0,0,{}]]]},{"name":"conv2d_Conv2D9","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D9","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU8",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU9","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU9","trainable":true},"inbound_nodes":[[["conv2d_Conv2D9",0,0,{}]]]},{"name":"conv2d_Conv2D10","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D10","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU9",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU10","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU10","trainable":true},"inbound_nodes":[[["conv2d_Conv2D10",0,0,{}]]]},{"name":"orient","class_name":"InputLayer","config":{"batch_input_shape":[null,6,8,1],"dtype":"float32","sparse":false,"name":"orient"},"inbound_nodes":[]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU10",0,0,{}],["orient",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D1","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D1",0,0,{}],["leaky_re_lu_LeakyReLU7",0,0,{}]]]},{"name":"conv2d_Conv2D11","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D11","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU11","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU11","trainable":true},"inbound_nodes":[[["conv2d_Conv2D11",0,0,{}]]]},{"name":"conv2d_Conv2D12","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D12","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU11",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU12","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU12","trainable":true},"inbound_nodes":[[["conv2d_Conv2D12",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D2","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D2","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU12",0,0,{}]]]},{"name":"concatenate_Concatenate3","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate3","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D2",0,0,{}],["leaky_re_lu_LeakyReLU6",0,0,{}]]]},{"name":"conv2d_Conv2D13","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D13","trainable":true},"inbound_nodes":[[["concatenate_Concatenate3",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU13","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU13","trainable":true},"inbound_nodes":[[["conv2d_Conv2D13",0,0,{}]]]},{"name":"conv2d_Conv2D14","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D14","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU13",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU14","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU14","trainable":true},"inbound_nodes":[[["conv2d_Conv2D14",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D3","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D3","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU14",0,0,{}]]]},{"name":"concatenate_Concatenate4","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate4","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D3",0,0,{}],["leaky_re_lu_LeakyReLU5",0,0,{}]]]},{"name":"conv2d_Conv2D15","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D15","trainable":true},"inbound_nodes":[[["concatenate_Concatenate4",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU15","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU15","trainable":true},"inbound_nodes":[[["conv2d_Conv2D15",0,0,{}]]]},{"name":"conv2d_Conv2D16","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D16","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU15",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU16","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU16","trainable":true},"inbound_nodes":[[["conv2d_Conv2D16",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D4","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D4","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU16",0,0,{}]]]},{"name":"concatenate_Concatenate5","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate5","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D4",0,0,{}],["leaky_re_lu_LeakyReLU4",0,0,{}]]]},{"name":"conv2d_Conv2D17","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D17","trainable":true},"inbound_nodes":[[["concatenate_Concatenate5",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU17","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU17","trainable":true},"inbound_nodes":[[["conv2d_Conv2D17",0,0,{}]]]},{"name":"conv2d_Conv2D18","class_name":"Conv2D","config":{"filters":37,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D18","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU17",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU18","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU18","trainable":true},"inbound_nodes":[[["conv2d_Conv2D18",0,0,{}]]]}],"input_layers":[["img",0,0],["orient",0,0]],"output_layers":[["leaky_re_lu_LeakyReLU18",0,0]]},"keras_version":"tfjs-layers 3.7.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[5,5,3,16],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[3,3,16,24],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[24],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[3,3,24,32],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[3,3,32,48],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[48],"dtype":"float32"},{"name":"conv2d_Conv2D5/kernel","shape":[3,3,48,64],"dtype":"float32"},{"name":"conv2d_Conv2D5/bias","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D6/kernel","shape":[3,3,64,128],"dtype":"float32"},{"name":"conv2d_Conv2D6/bias","shape":[128],"dtype":"float32"},{"name":"conv2d_Conv2D7/kernel","shape":[3,3,128,128],"dtype":"float32"},{"name":"conv2d_Conv2D7/bias","shape":[128],"dtype":"float32"},{"name":"conv2d_Conv2D8/kernel","shape":[3,3,128,256],"dtype":"float32"},{"name":"conv2d_Conv2D8/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D9/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D9/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D10/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D10/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D11/kernel","shape":[3,3,385,256],"dtype":"float32"},{"name":"conv2d_Conv2D11/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D12/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D12/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D13/kernel","shape":[3,3,384,256],"dtype":"float32"},{"name":"conv2d_Conv2D13/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D14/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D14/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D15/kernel","shape":[3,3,320,256],"dtype":"float32"},{"name":"conv2d_Conv2D15/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D16/kernel","shape":[3,3,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D16/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D17/kernel","shape":[3,3,304,256],"dtype":"float32"},{"name":"conv2d_Conv2D17/bias","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D18/kernel","shape":[3,3,256,37],"dtype":"float32"},{"name":"conv2d_Conv2D18/bias","shape":[37],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.7.0","convertedBy":null}