{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 768, 1024, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "img"}, "name": "img", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D1", "inbound_nodes": [[["img", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU1", "inbound_nodes": [[["conv2d_Conv2D1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D2", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D2", "inbound_nodes": [[["leaky_re_lu_LeakyReLU1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU2", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU2", "inbound_nodes": [[["conv2d_Conv2D2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D3", "inbound_nodes": [[["leaky_re_lu_LeakyReLU2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU3", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU3", "inbound_nodes": [[["conv2d_Conv2D3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D4", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D4", "inbound_nodes": [[["leaky_re_lu_LeakyReLU3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU4", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU4", "inbound_nodes": [[["conv2d_Conv2D4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D5", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D5", "inbound_nodes": [[["leaky_re_lu_LeakyReLU4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU5", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU5", "inbound_nodes": [[["conv2d_Conv2D5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D6", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D6", "inbound_nodes": [[["leaky_re_lu_LeakyReLU5", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU6", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU6", "inbound_nodes": [[["conv2d_Conv2D6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D7", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D7", "inbound_nodes": [[["leaky_re_lu_LeakyReLU6", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU7", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU7", "inbound_nodes": [[["conv2d_Conv2D7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D8", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D8", "inbound_nodes": [[["leaky_re_lu_LeakyReLU7", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU8", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU8", "inbound_nodes": [[["conv2d_Conv2D8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D9", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D9", "inbound_nodes": [[["leaky_re_lu_LeakyReLU8", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU9", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU9", "inbound_nodes": [[["conv2d_Conv2D9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D10", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D10", "inbound_nodes": [[["leaky_re_lu_LeakyReLU9", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU10", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU10", "inbound_nodes": [[["conv2d_Conv2D10", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 6, 8, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "orient"}, "name": "orient", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_Concatenate1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_Concatenate1", "inbound_nodes": [[["leaky_re_lu_LeakyReLU10", 0, 0, {}], ["orient", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_UpSampling2D1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_UpSampling2D1", "inbound_nodes": [[["concatenate_Concatenate1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_Concatenate2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_Concatenate2", "inbound_nodes": [[["up_sampling2d_UpSampling2D1", 0, 0, {}], ["leaky_re_lu_LeakyReLU7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D11", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D11", "inbound_nodes": [[["concatenate_Concatenate2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU11", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU11", "inbound_nodes": [[["conv2d_Conv2D11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D12", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D12", "inbound_nodes": [[["leaky_re_lu_LeakyReLU11", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU12", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU12", "inbound_nodes": [[["conv2d_Conv2D12", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_UpSampling2D2", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_UpSampling2D2", "inbound_nodes": [[["leaky_re_lu_LeakyReLU12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_Concatenate3", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_Concatenate3", "inbound_nodes": [[["up_sampling2d_UpSampling2D2", 0, 0, {}], ["leaky_re_lu_LeakyReLU6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D13", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D13", "inbound_nodes": [[["concatenate_Concatenate3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU13", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU13", "inbound_nodes": [[["conv2d_Conv2D13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D14", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D14", "inbound_nodes": [[["leaky_re_lu_LeakyReLU13", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU14", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU14", "inbound_nodes": [[["conv2d_Conv2D14", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_UpSampling2D3", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_UpSampling2D3", "inbound_nodes": [[["leaky_re_lu_LeakyReLU14", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_Concatenate4", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_Concatenate4", "inbound_nodes": [[["up_sampling2d_UpSampling2D3", 0, 0, {}], ["leaky_re_lu_LeakyReLU5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D15", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D15", "inbound_nodes": [[["concatenate_Concatenate4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU15", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU15", "inbound_nodes": [[["conv2d_Conv2D15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D16", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D16", "inbound_nodes": [[["leaky_re_lu_LeakyReLU15", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU16", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU16", "inbound_nodes": [[["conv2d_Conv2D16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_UpSampling2D4", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_UpSampling2D4", "inbound_nodes": [[["leaky_re_lu_LeakyReLU16", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_Concatenate5", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_Concatenate5", "inbound_nodes": [[["up_sampling2d_UpSampling2D4", 0, 0, {}], ["leaky_re_lu_LeakyReLU4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D17", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D17", "inbound_nodes": [[["concatenate_Concatenate5", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU17", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU17", "inbound_nodes": [[["conv2d_Conv2D17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D18", "trainable": true, "dtype": "float32", "filters": 37, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999974752427e-07}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D18", "inbound_nodes": [[["leaky_re_lu_LeakyReLU17", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_LeakyReLU18", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_LeakyReLU18", "inbound_nodes": [[["conv2d_Conv2D18", 0, 0, {}]]]}], "input_layers": [["img", 0, 0], ["orient", 0, 0]], "output_layers": [["leaky_re_lu_LeakyReLU18", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_Conv2D1/kernel", "shape": [5, 5, 3, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1491943238996992, "scale": 0.001264358677116095, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D1/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12060165931196773, "scale": 0.0008614404236569124, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D10/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1639247454848944, "scale": 0.0013219737539104388, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D10/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.023774319021579095, "scale": 0.00012579004773322273, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D11/kernel", "shape": [3, 3, 385, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18638292556884242, "scale": 0.0014013753802168602, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D11/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0824186975757281, "scale": 0.0005317335327466329, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D12/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1417620657121434, "scale": 0.0011715873199350693, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D12/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.070314433754367, "scale": 0.0003348306369255571, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D13/kernel", "shape": [3, 3, 384, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1559264880769393, "scale": 0.0012375118101344389, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D13/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06951533295944626, "scale": 0.0003905355784238554, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D14/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15826444473921084, "scale": 0.001189958231121886, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D14/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08812158854276526, "scale": 0.0004922993773338842, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D15/kernel", "shape": [3, 3, 320, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17797338115234002, "scale": 0.0012274026286368278, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D15/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09561551037956686, "scale": 0.0004979974498935774, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D16/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1430282094607166, "scale": 0.0009864014445566663, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D16/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1431995009382566, "scale": 0.0008182828625043233, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D17/kernel", "shape": [3, 3, 304, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15191904674558077, "scale": 0.0010195909177555757, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D17/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17534855113309974, "scale": 0.0010437413757922603, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D18/kernel", "shape": [3, 3, 256, 37], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.27983918248438366, "scale": 0.0016756837274513993, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D18/bias", "shape": [37], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0, "scale": 0.002042386290022656, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D2/kernel", "shape": [3, 3, 16, 24], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19599791882084866, "scale": 0.0015312337407878802, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D2/bias", "shape": [24], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06743016020924437, "scale": 0.0006130014564476762, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D3/kernel", "shape": [3, 3, 24, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19443525601835812, "scale": 0.0015937316067078534, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D3/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07061003429048202, "scale": 0.00045262842493898727, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D4/kernel", "shape": [3, 3, 32, 48], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21322021975236782, "scale": 0.0015450740561765784, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D4/bias", "shape": [48], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09544871063793406, "scale": 0.0005187429925974677, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D5/kernel", "shape": [3, 3, 48, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1694514973490846, "scale": 0.00130347305653142, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D5/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04248618822471768, "scale": 0.00024139879673135047, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D6/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.20024437518680796, "scale": 0.0014201728736653047, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D6/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.029040442779660225, "scale": 0.00010470544243706208, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D7/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15568295062757007, "scale": 0.0011363719023910223, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D7/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.018495284020900726, "scale": 3.55925666643124e-05, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D8/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13001542652354522, "scale": 0.001074507657219382, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D8/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.022810308974893653, "scale": 0.00010862051892806502, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D9/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1424319647690829, "scale": 0.0010550515908820956, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D9/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02942292019724846, "scale": 9.41829865469652e-05, "original_dtype": "float32"}}]}]}