{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "signature": {"inputs": {"orient": {"name": "orient:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}, {"size": "8"}, {"size": "1"}]}}, "img": {"name": "img:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "768"}, {"size": "1024"}, {"size": "3"}]}}}, "outputs": {"leaky_re_lu_LeakyReLU18": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "96"}, {"size": "128"}, {"size": "37"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model1/conv2d_Conv2D8/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D9/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D10/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate1/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D1/mul", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D7/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate2/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D11/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "385"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D12/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D2/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D6/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D13/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D14/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D3/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D5/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate4/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D15/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "320"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D16/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D4/mul", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "24"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate5/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D17/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "304"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D18/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "37"}]}}}}}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D18/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "37"}]}}}}}, {"name": "img", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "768"}, {"size": "1024"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "orient", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "6"}, {"size": "8"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU1/LeakyRelu", "op": "_FusedConv2D", "input": ["img", "StatefulPartitionedCall/model1/conv2d_Conv2D1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "leakyrelu_alpha": {"f": 0.3}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU2/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU1/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU3/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU2/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.3}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU4/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU3/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.3}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU5/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU4/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D5/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU6/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU5/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D6/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.3}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU7/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU6/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D7/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.3}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU8/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU7/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D8/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU9/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU8/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D9/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.3}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU10/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU9/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D10/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.3}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU10/LeakyRelu", "orient", "StatefulPartitionedCall/model1/concatenate_Concatenate1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D1/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model1/concatenate_Concatenate1/concat", "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D1/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D1/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU7/LeakyRelu", "StatefulPartitionedCall/model1/concatenate_Concatenate2/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU11/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/concatenate_Concatenate2/concat", "StatefulPartitionedCall/model1/conv2d_Conv2D11/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU12/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU11/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D12/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D2/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU12/LeakyRelu", "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D2/mul"], "attr": {"half_pixel_centers": {"b": true}, "align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate3/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D2/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU6/LeakyRelu", "StatefulPartitionedCall/model1/concatenate_Concatenate3/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU13/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/concatenate_Concatenate3/concat", "StatefulPartitionedCall/model1/conv2d_Conv2D13/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.3}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU14/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU13/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D14/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D3/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU14/LeakyRelu", "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D3/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate4/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D3/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU5/LeakyRelu", "StatefulPartitionedCall/model1/concatenate_Concatenate4/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU15/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/concatenate_Concatenate4/concat", "StatefulPartitionedCall/model1/conv2d_Conv2D15/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU16/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU15/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D16/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D4/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU16/LeakyRelu", "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D4/mul"], "attr": {"align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate5/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D4/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU4/LeakyRelu", "StatefulPartitionedCall/model1/concatenate_Concatenate5/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU17/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/concatenate_Concatenate5/concat", "StatefulPartitionedCall/model1/conv2d_Conv2D17/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D17/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.3}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU18/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU17/LeakyRelu", "StatefulPartitionedCall/model1/conv2d_Conv2D18/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model1/conv2d_Conv2D18/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model1/leaky_re_lu_LeakyReLU18/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of7.bin", "group1-shard2of7.bin", "group1-shard3of7.bin", "group1-shard4of7.bin", "group1-shard5of7.bin", "group1-shard6of7.bin", "group1-shard7of7.bin"], "weights": [{"name": "StatefulPartitionedCall/model1/conv2d_Conv2D8/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D8/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D9/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D9/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D10/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D10/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D1/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D7/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D7/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D11/Conv2D/ReadVariableOp", "shape": [3, 3, 385, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D11/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D12/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D12/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D2/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D6/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D6/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate3/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D13/Conv2D/ReadVariableOp", "shape": [3, 3, 384, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D13/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D14/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D14/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D3/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D5/Conv2D/ReadVariableOp", "shape": [3, 3, 48, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D5/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate4/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D15/Conv2D/ReadVariableOp", "shape": [3, 3, 320, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D15/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D16/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D16/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/up_sampling2d_UpSampling2D4/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D1/Conv2D/ReadVariableOp", "shape": [5, 5, 3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D2/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D2/BiasAdd/ReadVariableOp", "shape": [24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D3/Conv2D/ReadVariableOp", "shape": [3, 3, 24, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D3/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D4/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D4/BiasAdd/ReadVariableOp", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/concatenate_Concatenate5/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D17/Conv2D/ReadVariableOp", "shape": [3, 3, 304, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D17/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D18/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 37], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model1/conv2d_Conv2D18/BiasAdd/ReadVariableOp", "shape": [37], "dtype": "float32"}]}]}